# Taps (must come first)
tap "nikitabobko/tap"

# Tiling WM
cask "nikitabobko/tap/aerospace"

# Terminal
cask "ghostty"

# Shell
brew "starship"
brew "stow"

# Dev tools
brew "node"
brew "wget"

# Modern CLI
brew "fzf"
brew "ripgrep"
brew "fd"
brew "eza"
brew "zoxide"
brew "atuin"
brew "jq"
brew "yq"
brew "delta"
brew "tree"

# Editor
brew "neovim"

# Fonts
cask "font-hack-nerd-font"
